"use client";

const CompanyTerms = () => {
  return (
    <div className="m-1 text-sm text-gray-700">
      <h2 className="p-1 mb-4 font-bold border-b-1">시니어내일 기업회원 이용약관</h2>
      <section className="m-1">
        <h2 className="font-bold">제1조 (목적)</h2>
        <div>
          <p>
            이 약관은 시니어내일 플랫폼(이하 &quot;시니어내일&quot;)을 운영하는 회사(이하
            &quot;회사&quot;)와 &quot;시니어내일&quot;에 기업회원으로 가입하여 채용 관련 서비스를
            이용하는 자(이하 &quot;기업회원&quot; 또는 &quot;회원&quot;) 간에, 서비스 이용과 관련된
            권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
          </p>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제2조 (용어의 정의)</h2>
        <div>
          <p>본 약관에서 사용하는 주요 용어의 정의는 다음과 같습니다.</p>
          <br />
          <ul className="pl-5 list-disc">
            <li>
              <span className="ml-2 font-bold">&quot;회사&quot; : </span>
              &quot;시니어내일&quot; 서비스를 운영하는 사업자를 말합니다.
            </li>
            <br />
            <li>
              <span className="ml-2 font-bold">&quot;시니어내일&quot; : </span>
              &quot;회사&quot;가 제공하는 구인·구직 관련 온라인 플랫폼 및 제반 서비스를 의미하며,
              웹사이트와 모바일 웹/앱 등 다양한 매체를 통해 제공됩니다.
            </li>
            <br />
            <li>
              <span className="ml-2 font-bold">&quot;기업회원&quot; 또는 &quot;회원&quot; : </span>
              본 약관에 동의하고 &quot;회사&quot;가 정한 절차에 따라 기업회원으로 가입하여,
              &quot;시니어내일&quot;에서 채용공고 등록 등 채용 관련 서비스를 이용하는 개인사업자,
              법인 또는 기관을 말합니다.
            </li>
            <br />
            <li>
              <span className="ml-2 font-bold">&quot;구직자&quot; : </span>
              &quot;시니어내일&quot;에 개인회원으로 가입하여 구직 활동을 하는 이용자를 말합니다.
            </li>
            <br />
            <li>
              <span className="ml-2 font-bold">&quot;채용공고&quot;: </span>
              &quot;기업회원&quot;이 &quot;시니어내일&quot;을 통해 등록하는 채용 모집 관련 정보(회사
              소개, 모집 요강 등)를 말합니다.
            </li>
            <br />
            <li>
              <span className="ml-2 font-bold">&quot;서비스&quot;: </span>
              &quot;회사&quot;가 &quot;시니어내일&quot;을 통해 &quot;기업회원&quot;에게 제공하는
              채용공고 등록, 지원자 관리 등 채용 관련 기능과 기타 부가 서비스를 통칭합니다.
            </li>
          </ul>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제3조 (약관의 게시와 개정)</h2>
        <div>
          <p>
            &quot;회사&quot;는 본 약관의 내용을 &quot;기업회원&quot;이 가입 시 쉽게 알 수 있도록
            회원가입 화면 또는 연결 화면에 게시하며, &quot;기업회원&quot;은 가입 신청 시 본 약관에
            동의함으로써 이용계약이 성립됩니다. &quot;회사&quot;는 관련 법령을 위배하지 않는
            범위에서 본 약관을 개정할 수 있습니다. 약관을 개정하는 경우 적용일자 및 개정 내용을
            명시하여, 적용일 7일 전부터 &quot;기업회원&quot;에게 전자우편 또는 서비스 화면을 통해
            공지합니다. 다만, &quot;기업회원&quot;에게 불리한 변경의 경우에는 15일 이상 사전
            공지합니다. 공지 시 &quot;기업회원&quot;에게 별도 의사표시가 없으면 개정에 동의한 것으로
            본다는 취지를 함께 고지하였으며, &quot;기업회원&quot;이 명시적으로 거부 의사를 밝히지
            않는 경우 변경된 약관에 동의한 것으로 간주됩니다. &quot;기업회원&quot;이 변경된 약관에
            동의하지 않을 경우 이용계약을 해지할 수 있으며, 이 경우 &quot;회사&quot;는 해당 회원에
            대하여 개정 약관을 적용하지 않습니다. 이 약관에서 정하지 않은 사항과 약관의 해석에
            관하여는 관련 법령 및 상관례에 따릅니다.
          </p>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제4조(이용계약의 체결 및 기업회원 가입)</h2>
        <div>
          <p>
            &quot;기업회원&quot;으로 서비스를 이용하고자 하는 자는 본 약관과 개인정보처리방침에
            동의하고, &quot;회사&quot;가 정한 회원가입 신청 양식에 따라{" "}
            <span className="font-bold">
              회사명, 사업자등록번호, 담당자 이름, 연락처, 이메일 주소
            </span>{" "}
            등 필요한 정보를 정확히 기재하여 가입 신청을 해야 합니다. &quot;회사&quot;는 필요 시
            신청자가 제공한 사업자등록번호 등의 진위 확인을 위해{" "}
            <span className="font-bold">사업자등록증 제출</span> 등 추가 자료 제출을 요구하거나,
            전문기관을 통한 확인 절차를 진행할 수 있습니다.
          </p>
          <br />

          <ul className="pl-5 list-disc">
            <li>
              다음 각 호의 어느 하나에 해당하는 기업회원 가입 신청에 대해 &quot;회사&quot;는 승낙을
              거부하거나 보류할 수 있습니다.
              <br />
              <br />
              <ul className="pl-5 mt-1 list-disc marker:text-sm marker:text-gray-400">
                <li>허위 정보 또는 타인의 정보로 신청한 경우</li>
                <br />
                <li>
                  제출한 사업자 정보가 실제와 다르거나 유효하지 않은 경우 (예: 폐업 등으로 유효하지
                  않은 사업자등록번호로 신청한 경우)
                </li>
                <br />
                <li>
                  회원가입 신청서의 필수 기재사항을 누락하였거나 &quot;회사&quot;가 요청한 제출
                  서류를 제공하지 않은 경우
                </li>
                <br />
                <li>기타 &quot;회사&quot;가 기술상 또는 업무상 문제가 있다고 판단하는 경우</li>
              </ul>
            </li>
          </ul>
          <br />
          <p>
            회원가입의 성립 시기는 &quot;회사&quot;가 가입 완료 사실을 신청자에게 통지하거나 서비스
            화면에 표시한 시점으로 합니다. &quot;회사&quot;는 접수 순서에 따라 이용 신청을 심사하며,
            업무 또는 기술상 특별한 지장이 없는 한 가입 즉시 서비스 이용이 가능하도록 합니다. 다만,
            부정확한 정보 기재나 부적절한 신청으로 판단되는 경우 &quot;회사&quot;는 가입 이후에도
            회원 자격을 제한하거나 취소할 수 있습니다.
          </p>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제5조(서비스의 내용)</h2>
        <p>
          &quot;회사&quot;는 &quot;기업회원&quot;에게 다음과 같은 채용 관련 서비스를 제공합니다.
        </p>
        <br />
        <ul className="pl-5 list-disc">
          <li>
            <span className="font-bold">채용공고 등록 및 관리 : </span> &quot;기업회원&quot;은
            자사의 채용공고를 &quot;시니어내일&quot;에 등록하고, 필요에 따라 수정 또는 삭제할 수
            있습니다. 등록한 채용공고에 대한 지원 현황을 실시간으로 확인하고 관리할 수 있습니다.
          </li>
          <br />
          <li>
            <span className="font-bold">지원자 관리 서비스 : </span> &quot;기업회원&quot;은 해당
            채용공고에 지원한 구직자의 이력서 및 지원서를 열람하고, 합격 여부 통보 등 채용 절차를
            진행할 수 있습니다.
          </li>
          <br />
          <li>
            <span className="font-bold">인재 검색 서비스 : </span> &quot;기업회원&quot;은 공개
            이력서로 설정된 구직자의 이력서를 검색하여 열람할 수 있습니다. (※ 인재 검색 서비스의
            제공 여부와 범위는 &quot;회사&quot;의 정책에 따라 결정되며, 제공 시 별도로 안내합니다.)
          </li>
          <br />
          <li>
            <span className="font-bold">커뮤니케이션 서비스 : </span> &quot;기업회원&quot;은 채용
            진행을 위해 구직자에게 면접 일정 통보나 추가 정보 요청 등을 위한 메시지 전송 또는 이메일
            안내 기능을 이용할 수 있습니다
          </li>
          <br />
          <li>
            <span className="font-bold">기타 부가 서비스 : </span> 채용 브랜딩을 위한 콘텐츠 게시,
            채용 정보의 SNS 공유 등 &quot;회사&quot;가 추가 개발하거나 제휴를 통해 제공하는 모든
            서비스.
          </li>
        </ul>
        <br />
        <p>
          &quot;회사&quot;는 필요에 따라 기존 서비스의 내용을 변경하거나 새로운 서비스를 추가 제공할
          수 있습니다. 이 경우 변경되는 서비스의 내용 및 제공 일자를 사전에 &quot;회원&quot;에게
          공지하거나 통지합니다.
        </p>
      </section>
      <br />

      <section className="m-1">
        <h2 className="font-bold ">제6조(서비스 이용요금)</h2>
        <div>
          <p>
            &quot;시니어내일&quot;의 기업회원 가입 및 기본 서비스 이용은 현재 무료입니다. 다만, 추후
            &quot;회사&quot;가 부가적인 유료 서비스(예: 채용공고 노출 강화 상품, 인재 DB 열람권
            등)를 도입하는 경우, 해당 서비스의 내용, 요금 및 이용 조건을 사전에 안내할 것입니다.
            유료 서비스가 도입되면 &quot;기업회원&quot;은 안내된 요금 및 결제 방식에 따라 이용
            요금을 납부하고 서비스를 이용하여야 합니다. &quot;회사&quot;는 필요한 경우 유료 서비스의
            요금 및 정책을 변경할 수 있으며, 변경 시 사전 공지합니다. 이미 결제 완료한 서비스에 대한
            요금 변경은 소급 적용되지 않습니다.
          </p>
          <br />
          <ul className="pl-5 list-disc">
            <li>
              &quot;기업회원&quot;이 유료 서비스를 이용한 후 정당한 사유에 따라{" "}
              <span className="font-bold">청약철회</span> 또는 계약 해지를 요청하는 경우,
              &quot;회사&quot;는 관련 법령에 따라 환불을 처리합니다. 다만, 서비스의 성격상 사용이
              완료된 이후이거나 디지털 콘텐츠 등 즉시 효용이 발생하는 서비스의 경우 등 법령에서
              청약철회를 제한할 수 있는 사유에 해당하는 경우에는 그러하지 아니합니다.
            </li>
          </ul>
        </div>
      </section>
      <br />

      <section className="m-1">
        <h2 className="font-bold">제7조 (회원의 의무)</h2>
        <div>
          <p>
            &quot;기업회원&quot;은 본 약관, 운영정책, 서비스 안내 및 관계 법령을 준수하여야 하며,
            서비스 운영을 방해하는 행위를 해서는 안 됩니다. 특히, 다음의 사항을 준수해야 합니다.
          </p>
          <br />
          <ul className="pl-5 list-disc">
            <li>
              회원가입 및 서비스 이용을 위해 제공하는 기업 정보는 사실에 근거한 정확한 최신 정보여야
              하며, 허위 정보나 타인의 정보를 제공해서는 안 됩니다.
            </li>
            <br />
            <li>
              &quot;기업회원&quot;은 입력한 기업 정보(회사명, 담당자 연락처 등)가 변경될 경우 지체
              없이 &quot;회사&quot;에 최신 정보로 수정·제공하여야 합니다.
            </li>
            <br />
            <li>
              &quot;기업회원&quot;은 자신의 계정(ID)과 비밀번호를 철저히 관리할 책임이 있으며, 이를
              제3자에게 이용하게 하거나 양도, 대여해서는 안 됩니다. 관리 소홀이나 부정 이용으로
              발생한 손해에 대한 책임은 해당 &quot;기업회원&quot;에게 있습니다.
            </li>
            <br />
            <li>
              &quot;기업회원&quot;은 서비스 이용을 통해 얻은 구직자 정보를 채용 목적 외 용도로
              이용하거나 당사자의 동의 없이 제3자에게 제공해서는 안 됩니다. (구직자 개인정보의
              활용은 해당 구직자의 동의 범위 내에서만 가능하며, 위반 시 모든 책임은
              &quot;기업회원&quot;에게 있습니다.)
            </li>
            <li>
              &quot;기업회원&quot;은 채용공고를 등록함에 있어 관련 법령을 준수하고 사회 통념에
              반하지 않는 내용을 작성해야 합니다. 부정확하거나 허위의 모집 내용, 차별적이거나
              불법적인 내용, 기타 관계 법령에 위배되는 내용을 공고에 포함해서는 안 됩니다.
            </li>
            <li>
              &quot;기업회원&quot;이 등록한 채용공고가 관련 법령이나 &quot;회사&quot;의 게시 기준에
              위반되는 경우, &quot;회사&quot;는 사전 통보 없이 해당 공고를 비공개 처리하거나 삭제할
              수 있습니다.
            </li>
          </ul>
          <br />
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제8조(자료 내용의 책임 및 관리)</h2>
        <div>
          <p>
            &quot;기업회원&quot;이 서비스 내에 등록한 기업 정보와 채용공고 내용의 책임은 해당
            &quot;기업회원&quot;에게 있습니다. &quot;기업회원&quot;은 등록하는 정보가 정확하고
            최신의 것이며 제3자의 권리를 침해하지 않도록 주의하여야 합니다. 만약
            &quot;기업회원&quot;이 허위의 기업 정보나 사실과 다른 채용 내용을 등록하여 발생한 문제에
            대해서는 모든 책임을 해당 &quot;기업회원&quot;이 부담하며, &quot;회사&quot;는 고의
            <br />
            또는 중대한 과실이 없는 한 이에 대해 책임을 지지 않습니다. 또한 &quot;회사&quot;는
            &quot;기업회원&quot;이 등록한 정보가 허위이거나 사회 질서에 반한다고 판단하는 경우, 사전
            통지 없이 해당 정보를 삭제하거나 열람을 제한할 수 있습니다. 이로 인해 서비스 이용에
            제약이 발생하더라도, &quot;회사&quot;는 고의 또는 중대한 과실이 없는 한 책임지지
            않습니다.
          </p>
          <br />
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제9조(회원 탈퇴 및 자격 제한)</h2>
        <div>
          <p>
            &quot;기업회원&quot;은 언제든지 &quot;회사&quot;에 회원 탈퇴를 요청함으로써 이용계약
            해지를 할 수 있습니다. 탈퇴 요청은 &quot;시니어내일&quot; 관리자 페이지나 고객센터를
            통해 신청할 수 있으며, &quot;회사&quot;는 관련 법령에 따라 탈퇴 절차를 처리합니다. 회원
            탈퇴 시 법령에 따라 보존이 필요한 정보를 제외한 나머지 기업회원의 정보는 모두
            삭제됩니다.
          </p>
          <br />
          <ul className="pl-5 list-disc">
            <li>
              &quot;기업회원&quot;이 다음 각 호의 사유에 해당하는 경우, &quot;회사&quot;는 사전 통지
              후 회원 자격을 제한하거나 일시 정지시킬 수 있습니다.
              <ul className="pl-5 mt-1 list-decimal marker:text-sm">
                <br />
                <li>서비스 신청 또는 이용 시 허위의 내용을 기재하거나 중요한 정보를 누락한 경우</li>
                <br />
                <li>
                  다른 회원의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를
                  위협하는 행위를 한 경우
                </li>
                <br />
                <li>
                  서비스를 이용하여 법령 또는 본 약관이 금지하는 행위를 하거나 공공질서·미풍양속에
                  반하는 행위를 한 경우
                </li>
                <br />
                <li>
                  유료 서비스 이용 요금을 정해진 기한 내 지급하지 않거나 부정한 방법으로 결제한 경우
                </li>
                <br />
                <li>
                  기타 &quot;기업회원&quot;으로서 부적절한 행위를 하였거나 본 약관에서 규정한 의무를
                  위반한 경우
                </li>
              </ul>
            </li>
          </ul>
          <br />
          <p>
            &quot;회사&quot;가 전항에 따라 회원 자격을 제한·정지시킨 후 동일한 위반 행위가 2회 이상
            반복되거나 상당한 기간 내에 시정되지 않는 경우, &quot;회사&quot;는 해당
            &quot;기업회원&quot;의 회원 자격을 상실시킬 수 있습니다. 이 경우 회원 자격 상실 전에
            해당 &quot;기업회원&quot;에게 이를 통지하고 소명할 기회를 제공합니다.{" "}
            <span className="font-bold">회원 자격이 상실된 경우 이용계약은 자동 해지</span>되며,
            &quot;회사&quot;는 관련 법령에 따라 해당 기업회원의 정보를 삭제하거나 별도로 분리 보관할
            수 있습니다. 회원 자격 상실로 인한 서비스 이용 제한 또는 계약 해지로 발생하는 손해에
            대해 &quot;회사&quot;는 책임지지 않습니다.
          </p>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제10조(정보의 제공 및 광고)</h2>
        <p>
          &quot;회사&quot;는 서비스 이용과 관련하여 &quot;기업회원&quot;에게 필요한 정보나 혜택 등을
          전자우편, 문자메시지, 앱 푸시 등의 방법으로 제공할 수 있습니다. 다만,
          &quot;기업회원&quot;은 수신 거절을 할 수 있으며, 수신 거절 시 이러한 정보나 혜택 제공을
          중단합니다. (단, 거래와 관련된 중요 공지 사항 등은 수신 거부와 관계없이 전달될 수
          있습니다.)
        </p>
        <br />
        <p>
          &quot;회사&quot;는 서비스 화면, 웹사이트, 이메일 등에 회사 또는 제휴사의 광고를 게재할 수
          있으며, &quot;기업회원&quot;은 서비스 이용 시 노출되는 광고에 대해 동의한 것으로 봅니다.
          &quot;회사&quot;가 제공하는 광고나 제휴 이벤트 등을 통해 &quot;기업회원&quot;이 외부
          업체와 거래나 통신을 하는 경우, 그로부터 발생하는 손실이나 손해에 대해 &quot;회사&quot;는
          책임을 지지 않습니다.
        </p>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제11조(개인정보 보호)</h2>
        <p>
          &quot;회사&quot;는 &quot;기업회원&quot;이 제공한 기업 정보 및 담당자 개인정보를 관련
          법령과 &quot;회사&quot;의 개인정보처리방침에 따라 수집·이용하며 안전하게 관리합니다.
          &quot;회사&quot;는 수집된 정보를 원활한 서비스 제공 목적 이외의 용도로 사용하거나,
          &quot;회원&quot;의 동의 없이 제3자에게 제공하지 않습니다. 또한 &quot;기업회원&quot;은
          서비스 이용 중 취득한 구직자의 개인정보(이력서 등)를 해당 구직자의 동의 없이 제3자에게
          제공하거나 채용 목적 외의 용도로 이용할 수 없습니다. 만약 &quot;기업회원&quot;이 지원자의
          개인정보를 본 약관이나 관련 법령을 위반하여 이용한 경우 그로 인한 모든 책임은 해당
          &quot;기업회원&quot;에게 있으며, &quot;회사&quot;는 이에 대해 책임을 지지 않습니다. 이
          외에 개인정보 보호와 관련된 사항은 개인정보처리방침 및 관련 법령에 따릅니다.
        </p>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제12조(책임의 한계 및 면책사항)</h2>
        <div>
          <p>
            &quot;회사&quot;는 천재지변, 전쟁, 화재, 정전, 통신 장애 등
            <span className="font-bold">불가항력적인 사유로 서비스를 제공할 수 없는 경우</span>에는
            서비스 제공에 관한 책임이 면제됩니다. &quot;회사&quot;는 &quot;기업회원&quot;의
            귀책사유로 인하여 발생한 서비스 이용의 장애에 대해서 책임을 부담하지 않습니다. 또한
            &quot;기업회원&quot;이 자신의 계정 정보를 타인과 공유하거나 유출하여 발생한 손해에
            대해서도 책임지지 않습니다.
          </p>
          <br />
          <p>
            &quot;회사&quot;는 &quot;기업회원&quot;이 제공한 기업 정보 및 채용공고 내용의 정확성이나
            신뢰성을 보증하지 않으며, 그에 대한 책임은 전적으로 해당 &quot;기업회원&quot;에게
            있습니다. 마찬가지로 &quot;회사&quot;는 구직자가 제공한 이력서 및 기타 정보의 진실성에
            대해 책임을 지지 않습니다.
          </p>
          <br />
          <p>
            &quot;회사&quot;는 &quot;시니어내일&quot; 플랫폼을 통한
            <span className="font-bold">
              기업회원과 구직자 간의 채용 계약 또는 고용관계에 개입하지 않으며,
            </span>
            이로 인해 발생하는 분쟁이나 손해에 대해 책임을 지지 않습니다. 채용 절차 및 결과에 관한
            책임은 전적으로 채용 당사자인 &quot;기업회원&quot;과 구직자에게 있습니다.
          </p>
          <br />
          <p>
            무료로 제공되는 서비스 및 부가 정보와 관련하여 &quot;기업회원&quot;에게 발생한 손해에
            대해서, 특별한 사정이 없는 한 &quot;회사&quot;는 책임을 지지 않습니다. 또한
            &quot;회사&quot;가 합리적인 주의를 기울였음에도 불구하고 발생한 시스템 오류, 데이터
            손실, 서비스 중단 등에 대해서는 관련 법령이 허용하는 한도 내에서 책임이 면제됩니다. 단,
            <span className="font-bold">
              &quot;회사&quot;의 고의 또는 중대한 과실로 인해 발생한 손해
            </span>
            에 대해서는 본 면책 조항이 적용되지 않습니다.
          </p>
        </div>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">제13조(분쟁 해결 및 관할)</h2>
        <p>
          &quot;회사&quot;와 &quot;기업회원&quot;은 서비스 이용과 관련하여 발생한 분쟁을 원만하게
          해결하기 위해 성실히 협의합니다. 협의로 해결되지 아니하여 소송이 제기되는 경우,
          「민사소송법」 등 관련 법령에 따라 관할 법원을 결정합니다. 본 서비스 이용과 관련된 분쟁에
          관한 소송은 {""}
          <span className="font-bold">&quot;회사&quot; 본사 소재지를 관할하는 법원</span>을 관할
          법원으로 합니다.
        </p>
      </section>
      <br />
      <section className="m-1">
        <h2 className="font-bold">부칙</h2>
        <p>이 약관은 2025년 5월 10일부터 시행합니다.</p>
      </section>
    </div>
  );
};
export default CompanyTerms;
